Repository: jasomdotnet/DigitalNomad
Catalog: languages/digital-nomad-*.po
Languages: ru_ru

source: This is famous Error 404!
ru_ru: Вы попали на 404!

source: Goob job, you found a page that doesn't exist.
ru_ru: Вы счастливчик: нашли страницу, которой нет.

source: Try to use search form below or read my latest post:
ru_ru: Попробуйте загуглить или посмотрите что-то из свежего:

source: &laquo; Previous Comments
ru_ru: &laquo; Коменты раньше

source: Next Comments &raquo;
ru_ru: Коменты позже &raquo;

source: Rescroll to load news posts.
ru_ru: Крутаните мышь — найдете еще картинок.

source: No more posts
ru_ru: Картинки закончились, прости

source: Something unexpected happened with AJAX request :-/
ru_ru: Ой, вы сайт сломали, AJAX не работает

source: edited:
ru_ru: ред:

source: %s ago
ru_ru: %s назад

source: More pages:
ru_ru: Еще полистать:

source: Previous post:
ru_ru: Назад на пост:

source: Next post:
ru_ru: Вперед на пост:

source: &laquo; Previous Page
ru_ru: &laquo; Пред. стр

source: Next Page &raquo;
ru_ru: След. стр. &raquo;

source: &uarr; Up
ru_ru: &uarr; Наверх

source: Up &uarr;
ru_ru: Наверх &uarr;

source: Powered by %s.
ru_ru: %s.

source: Themed by %s.
ru_ru: Дизайн %s.

source: Post Archive Page
ru_ru: Архив

source: There are no posts.
ru_ru: Здесь ничего нет.

source: (no title)
ru_ru: (без названия)

source: Your comment is awaiting moderation.
ru_ru: Коммент на модерации, подожди.

source: Your comment is awaiting moderation. This is a preview, your comment will be visible after it has been approved.
ru_ru: Коммент на модерации, а ты видишь превью. Окончательно появится после одобрения.

source: %s <span class="says">said on</span>
ru_ru: %s <span class="says">написал</span>

source: %1$s at %2$s
ru_ru: %1$s в %2$s

source: Edit
ru_ru: Править

source: Skip to content
ru_ru: К контенту

source: Some features may not work without JavaScript
ru_ru: Часть функций отключена без JS

source: Jump Down
ru_ru: Вниз

source: Digital Nomad Settings
ru_ru: Настройки темы

source: Background Image For Footer
ru_ru: Фоновая картинка для подвала

source: Image used in footer as background.
ru_ru: Фон подвала.

source: Default Featured Image
ru_ru: Картинка по умолчанию

source: Image used in post preview when no feature image is set in the post.
ru_ru: Изображение превью, если нет картинки в посте.

source: Archive Page
ru_ru: Архив

source: Select a <a href="%s">static page</a> which will serve as archive for posts.
ru_ru: Выберите <a href="%s">статичную картинку</a> для постов.

source: Infinite Scroll
ru_ru: Бесконечный скролл

source: Enable infinite scroll for blog archive, categories and tags.
ru_ru: Подключить бесконечную прокрутку для постов, категорий и тегов.

source: Lazyload
ru_ru: Фоновая подгрузка

source: Enable lazyload using bLazy (vanilla JS library).
ru_ru: Подключить подгрузку через bLazy (библиотечка JS).

source: Background Image For Previous Pager
ru_ru: Фон для предыдущего поста

source: Image used as bacground in "previous" post(s) navigation.
ru_ru: Картинка для фона ссылки на предыдущий пост.

source: Background Image For Next Pager
ru_ru: Фон для следующего поста

source: Image used as bacground in "next" post(s) navigation.
ru_ru: Картинка для фона ссылки на следующий пост.

source: Digital Nomad
ru_ru: Цифровой путешественник (Digital Nomad)

source: Welcome to Digital Nomad
ru_ru: Добро пожаловатьв тему Цифровой путешественник (Digital Nomad)

source: Congrats on choosing Digital Nomad, theme for digital nomads like you.
ru_ru: Спасибо, что выбрали тему для путешественников Digital Nomad.

source: Theme Homepage
ru_ru: Домашняя страница темы

source: Configuration
ru_ru: Настройки

source: Follow these steps to set up theme correctly:
ru_ru: Для настройки темы выполните следующие шаги:

source: Install using a child theme to avoid custom overrides lost. Learn more about child themes on <a href="%s">Wordpress.org</a>.
ru_ru: Установить через дочернюю тему, чтобы не потерять данные при обновлении. Читайте о подтемах на <a href="%s">Wordpress.org</a>.

source: Under <a href="%s">Widgets</a> add menu/about text for Header sidebar. Use "Custom HTML" widget.
ru_ru: В разделе <a href="%s">Виджеты</a> добавьте пункт меню с текстом в Заголовок, используя опцию "Свой HTML".

source: In <a href="%s">Customizer</a> set:
ru_ru: В пункте <a href="%s">Настройки</a>:

source: Under "Site Identity" set square "Logo" and "Site Icon".
ru_ru: В пункте "Идентика сайта" поставьте квадратное "Лого" и "Иконку сайта".

source: Under "Header Image" set background picture for header.
ru_ru: В пункте "Изображение Заголовка" выберите фоновую картинку для заголовка.

source: Under "Homepage Settings" use "Your latest posts" as homepage display.
ru_ru: В пункте "Настройки главной" используйте "Последние посты" для вывода.

source: Under "Digital Nomad Options":
ru_ru: В настройках "Digital Nomad":

source: Set "Background Image For Footer"
ru_ru: Установите "Фоновую картинку для подвала"

source: Set "Default Featured Image", image used in post archives when no feature image is selected.
ru_ru: Установите "Картинку по умолчанию", для вывода на странице постов, когда изображение не выбрано.

source: Select static "Archive Page" which will be used as an archive for all posts. Date archives are disabled by default and will return 404 if no archive page is selected.
ru_ru: Выберите статическую страницу для "Архива постов" для полного архива. Архив по дате по умолчанию деактивирован и возвращает ошибку 404 при выборе.

source: Enable "Infinite Scroll" for latest posts, categories and tags. Custom post types and custom taxonomies are also supported.
ru_ru: Подключите "Бесконечный скролл" для последних записей, категорий и тегов. Также поддерживаются пользовательские типы постов и тегов.

source: Enable "Lazyload" for latest posts, categories and tags. NOTE: Images in posts are not nativelly lazyloaded
ru_ru: Подключить "Подгрузку" постов, категорйи и тегов. Обратите внимание, что изображения при этом не подгружаются заранее

source: Set "Background Image For Next & Previous Pager" for &lt;noscript&gt; support.
ru_ru: Установите "Фоновое изображение для следующего и предыдущего постов" для поддержки &lt;noscript&gt;.

source: That's it!
ru_ru: Вот и все!

source: Recommended Plugins
ru_ru: Рекомендуем плагины

source: reSmush.it Image Optimizer
ru_ru: оптимизатор изображений reSmush.it

source: Digital Nomad theme relies heavy on images. reSmush.it is free service providing image size reduction based on several advanced algorithms. The API accept JPG, PNG and GIF files up to 5MB. Set reSmush,it quality to 82.
ru_ru: Тема Digital Nomad основана на изображениях. reSmush.it - это бесплатный сервис, позволяющий уменьшить размер на основе продвинутых алгоритмов. API принимает файлы JPG, PNG и GIF до 5МБ. Установите качество reSmush,it на уровень 82.

source: Yoast SEO
ru_ru: Оптимизация Yoast SEO

source: My favorite option when it comes to SEO plugin for WordPress. Yoast SEO generates sitemap.xml, sets page titles, creates metatags, etc.
ru_ru: Мой выбор касательно плагинов для SEO под WordPress. Yoast SEO создает файл sitemap.xml, указывает названия страниц, создает метатеги и пр.

source: Code Syntax Block
ru_ru: Блок для подсветки кода

source: A plugin to extend Gutenberg code block with syntax highlighting.
ru_ru: Этот плагин позволяет подсвечивать код в рамках редактора Gutenberg.

source: WP Super Cache
ru_ru: Кеширование WP Super Cache

source: Don not leave your site without enabled cache. WP Super Cache from Automattic does the job well.
ru_ru: Используйте сайт только с подключенным кешированием. Плагин WP Super Cache разработки Automattic прекрасно справляется с этим.

source: Post-installation Actions
ru_ru: После установки

source: Leave a review
ru_ru: Напишите отзыв

source: If you like Digital Nomad, review the theme on WordPress.org. Leave a review even if you don't like it.
ru_ru: Если вам нравится тема Digital Nomad, напишите обзор на WordPress.org. Если не нравится, тоже напишите.

source: Feature Requests
ru_ru: Запросы функций

source: Send feature request for Digital Nomad theme.
ru_ru: Напишите, что вам требуется в теме Digital Nomad.

source: Follow me on Twitter
ru_ru: Подпишитесь на меня на Twitter

source: If you like my work, follow me on Twitter.
ru_ru: Если нравится, что я делаю, подпишитесь на меня в Twitter.

source: What theme does not
ru_ru: Чего в теме нет

source: Theme doesn't require jQuery so (after additional optimalization) you can easily reach out high score in Google's PageSpeed Insights.
ru_ru: Тема не требует jQuery, пожтому (с правильной оптимизацией) вы сможете бить рекорды по скорости загрузки на Google PageSpeed.

source: Theme doesn't support post-formats. I have personally never used this WordPress feature and that's why I didn't add support.
ru_ru: Тема не форматирует посты. Я сам никогда не использовал эту встроенную функцию WordPress, поэтому поддержку ее не включал.

source: Theme doesn't use navigation menus. Instead, it uses short about-me text in the header which can be hotlinked to various sections of the blog.
ru_ru: Тема не использует меню навигации, только краткий текст об авторе, который можно залинковать на любые разделы блога.

source: @TODO
ru_ru: На очереди

source: Add native lazyloading for post images.
ru_ru: Нативная предзагрузка изображений.

source: Add Medium like zoom for post images.
ru_ru: Добавление зума в стиле Medium для изображений в постах.

source: It's not in theme, it's in the content! But good theme also helps...
ru_ru: Секрет успеха не в теме, а в контенте. Но хорошая тема помогает...

source: Digital Nomad theme activated. <a href="%s">Visit configuration instructions here</a>.
ru_ru: Тема Digital Nomad активирована. <a href="%s">Посмотрите инструкции по настройке</a>.

source: Header text
ru_ru: Текст заголовка

source: Menu/about text for Header sidebar. Use "Custom HTML" widget.
ru_ru: Текст раздела Меню/О сайте для боковой колонки Заголовка. Используйте виджет "Свой HTML".

source: Archive
ru_ru: Архив

source: Header default image
ru_ru: Изображение Заголовка по умолчанию

source: Footer default image
ru_ru: Изображение Подвала по умолчанию

source: Feature default image
ru_ru: Изображение Избранного изображения по умолчанию

source: About like menu
ru_ru: Меню раздела О сайте

source: Search Results for: %s
ru_ru: Найдено по запросу: %s

source: Page not found
ru_ru: Страница не нашлась

source: Asides
ru_ru: Дополнительно

source: Images
ru_ru: Изображения

source: Videos
ru_ru: Видео

source: Quotes
ru_ru: Цитаты

source: Links
ru_ru: Ссылки

source: No content, empty, zero, nothing...
ru_ru: Здесь ничего, тупо, просто, ноль, ничегошечки...

source: Permalink for: %s
ru_ru: Постоянная ссылка для: %s
